using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// <summary>
/// <right>دسته‌بندی</right>
/// <right>نسخه: 1.0.0</right>
/// <right>تاریخ: 1403.07.11</right>
/// </summary>
namespace HJafr.Enums
{
    /// <summary>
    /// <right>دایره حروف</right>
    /// </summary>
    public enum D_name
    {
        #region اصلی
        ابجد,
        ابتث,
        اهطم,
        ایقغ,
        #endregion

        /// ا
        //  ب
        ابجدمغاربه,
        ابجد3,
        ابهو,
        ابهش,
        ابتج,

        //  ج
        اجهب,
        اجهز,
        اجهز2,
        اجهز3,
        اجهز4,
        اجعف,
        اجنذ,
        اجذش,
        اجذش2,
        اجذش3,
        اجذش4,

        //  د
        ادجه,
        ادزی,
        ادزی2,
        ادزی3,
        ادثت,
        ادضک,

        //  ه‍
        اهوی,
        اهحط_نور,
        اهطم2,
        اهثم,

        //  و
        اوزی,
        اوزی2,
        اویل,
        اویل2,
        اوکع,
        اوضک,

        //  ز
        ازمق,
        ازمق2,
        ازمق3,

        //  ح
        احجش,
        احزط,
        احزط2,
        احطم,
        احمد,
        احسی,
        احسن,
        احست,
        احست2,

        //  ط
        اطفذ,
        اطفذ2,
        اطفذ3,
        اطفذ4,

        //  ی
        ایبه,
        ایقغ2,
        ایقغ3,
        ایقغ4,
        ایقغ5,

        //  ک
        اکدح,
        اکدخ,
        اکصذ,
        اکشب,
        اکشب2,
        اکشج,
        اکذق,

        //  ل
        الهط,
        الهط2,
        الشب,
        الثب,
        الثو,

        //  م
        اموس,
        امرض,
        امذب,
        امذط,
        امذر,

        //  ن
        اندع,
        انسج,
        انسغ,
        انظب,
        انظل,
        انظف,

        //  س
        اسبع,
        اسغن,
        اسغن2,
        اسغن3,

        //  ع
        اعجص,
        اعهط,
        اعهط2,
        اعکج,
        اعلی,

        //  ف
        افهش,
        افوت,
        افطم,
        افسج,
        افسج2,
        افسج3,
        افسج4,
        افعت,
        افخح,

        //  ص
        اصهظ,
        اصحذ,
        اصزخ,
        اصته,

        //  ق
        اقبر,
        اقبر2,
        اقیغ,
        اقطظ,
        اقرب,

        //  ر
        ارکب,
        ارلد,
        ارصج,
        ارغی,
        ارغی2,
        ارغی3,
        ارغی4,

        //  ش
        اشمه,
        اشنف,

        //  ت
        اتجخ,
        اتجخ2,
        اتنط,
        اتسح,

        //  ث
        اثفک,
        اثصم,
        اثخر,
        اثخر2,
        اثخر3,

        //  خ
        اخیس,
        اخقن,
        اخشغ,

        //  ذ
        اذحص,
        اذشف,
        اذظن,

        //  ض
        اضیص,
        اضثر,
        اضخت,

        //  ظ
        اظبغ,
        اظدخ,
        اظمد,
        اظذث,

        //  غ
        اغبظ,
        اغفب,
        اغظض,


        /// ب
        بدوح,
        بثحد,

        /// د
        دحلع,
        دطمن,

        /// ز
        زنشغ,

        /// ح
        حعخذ,

        /// ط
        طنذخ,

        /// ی
        یاهب,

        /// ن
        نادعلی,
        نخعص,
        نغسا,

        /// س
        سوال,

        /// ع
        عذطز,

        /// ص
        صیضا,

        /// ت
        تثخذ,

        /// ث
        ثدسط,

        /// خ
        خدیع,
        خصقی,

        /// ذ
        ذزصن,

        /// غ
        غاظب,
        غسنا,


        /// سوره‌های قرآن
        سوره1,




        end,

        عبری = 9998,
        انگلیسی = 9999
    };

    /// <summary>
    /// <right>دایره عدد</right>
    /// </summary>
    public enum D_int
    {
        کبیر, kabir = 0,
        معکوس,
        وضعی,
        افلاکی,
        صغیر,
        بروجی,

        عناصری,
        کواکبی,
        منازلی,
        آحاد,
        عشرات,
        مآت,
        الوف,

        ابجدادریسی,
        ابجدعددوسط,
        ابجدثانی,
        ابجدعلوی,
        ابجدازامیر,
        ابجدشعیب,
        ابجدنبوی,

        ابتث_آدم,
        ابتث_امیر,
        ابتث_صادق,

        اهطم_مرتبه,
        اهطم_هجا,
        اهطم_فیثاغورث,
        اهطم_دانیال,
        اهطم_وسطی,
        اهطم_مثلثات,
        اهطم_تسلط,
        اهطم_مراد,

        ایقغ_ابجدکبیر,
        ایقغ_یوشع,


        فال_1
    }

    /// <summary>
    /// برج
    /// </summary>
    public enum برج
    {
        حمل,
        ثور,
        جوزا,
        سرطان,
        اسد,
        سنبله,
        میزان,
        عقرب,
        قوس,
        جدی,
        دلو,
        حوت
    }

    /// <summary>
    /// کوکب
    /// </summary>
    public enum کوکب
    {
        زحل,
        مشتری,
        مریخ,
        شمس,
        زهره,
        عطارد,
        قمر
    }





    public enum طبع
    {
        آتش,
        باد,
        آب,
        خاک,
    }

    public enum ابتدا_انتها
    {
        ابتدا_ابتدا,
        انتها_انتها,
        ابتدا_انتها,
        انتها_ابتدا
    }
    public enum تکسیر_انواع
    {
        چنددور,
        زمام,
        منقطع,
        تکرار
    }
    public enum نحودسته
    {
        ساده_ساده,
        وارون_وارون,
        ساده_وارون,
        وارون_ساده
    }
    public enum تبدیل_طبع
    {
        ترفع_منقطع,
        ترفع_چرخشی,
        تنزل_منقطع,
        تنزل_چرخشی,
        مقوی_مربی,
        مقوی_به_مربی,
        مربی_به_مقوی,
        تناقض,
        تناقض_تخفیف,
        تناقض_تشدید,
        معکوس,
        معکوس_تخفیف,
        معکوس_تشدید,

        آتش,
        باد,
        آب,
        خاک,
    }

    public enum روش_استنطاق
    {
        شرقی,
        غربی,
        قدیم
    }
    public enum شرق_غرب
    {
        شرقی,
        غربی
    }
    public enum عمل_ریاضی
    {
        جمع,
        تفریق,
        ضرب,
        تقسیم,
        باقیمانده,
        اسقاط,
        طرح_اسقاط,
    }
    public enum اتصال_لقط
    {
        منفصل,
        متصل_حذفی,
        متصل_باتکرار
    }
    public enum نورانی
    {
        تنویر,
        تظلیم,
        معکوس
    }





    public enum صفحات
    {
        //  بخش اصلی
        حساب,
        استنطاق,
        اساس,
        دور,
        تفکیک,
        بسط,
        تکسیر,
        امتزاج,
        لقط,

        //  ابزار
        اعمال_ریاضی,
        بسطخاص,
        تکسیرجامع,
        بطن_اسماء,
        رمز,
        حرکت,

        ///  قرآن

        //  جفر
        جفرجامع,
        جفرسداسی,
        جفرنادعلی,
        جفرطرح‌غالب,
        خورشیدجفر,
        جفرمهندسی1,
        جفرمهندسی2,
        جفرمهندسی3,
        جفرصدیقی,
        جفر15نسبت,
        جفر15دور,
        جفر15قوا,
        جفر15صفحه,

        //  فال
        ابجدی,
        فال_مفتاح_الغیوب,
        فال_تفال_مجرب,
        فالنامه_شیخ_بهایی,
        فالنامه_ابن_عربی,
        فال_چوب,

        ///  رمل

        //  نجوم
        اوقات_و_ساعات,

        //  راهنما
        کتاب,
        نمایشدایره,

        //  درباره
        تقدیم,
        درباره_نسخه,
        ارتباطباما,


        test
    }

    public enum پیام
    {
        //  head
        خطا,

        //  tooltip
        do_it,
        harf,
        adad,
        help,

        //  DAlert
        v0,
        v1,
        all1,
        all2,
        k01,
        k02,
        k11,
        k12,
        k99,
        mohas,

        //  OkButtonContent
        خواندم,
    }
}
