using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

/// <summary>
/// <right>رمل</right>
/// <right>نسخه: 0.5.0</right>
/// <right>تاریخ: 1403.07.11</right>
/// </summary>
namespace HJafr.raml_cs
{
    /// <summary><right>رمل</right></summary>
    class Raml
    {
        #region نام و شکل
        string[,] shekl = new string[16, 5] {
            { ".|||", "لحیان", "", "", ""},
            { "|.||", "حمره", "", "", ""},
            { "..||", "نصرة الخارج","", "", ""},
            { "||.|", "بیاض","", "", ""},
            { ".|.|", "قبض الخارج", "", "", ""},
            { "|..|", "اجتماع", "", "", ""},
            { "...|", "عتبة الخارج", "", "", ""},
            { "|||.", "انکیس","", "", ""},
            { ".||.", "عقلة", "", "", ""},
            { "|.|.", "قبض الداخل","", "", ""},
            { "..|.", "فرخ","", "", ""},
            { "||..", "نصرة الداخل","", "", ""},
            { ".|..", "نقیّ", "", "", ""},
            { "|...", "عتبه الداخل", "", "", ""},
            { "....", "طریق","", "", ""},
            { "||||", "جماعت","", "", ""}};
        #endregion

        #region منسوبات اشکال
        //  ترتیب : 0.عنصر - 1.سعدونحس - 2.جنسیت - 3.کوکب - 4.برج - 5.روزهفته - 6.جهت - 7.جسم - 8.رنگ - 9.عضو - 10.شکل - 11.فصل - 12.حرف - 13.زمان - 14.علت بیماری - 15.طعم - 16.صنف - 17.بازوبسته - 18.جوان و پیر - 19.روز و شب - 20.مزاج - 21.سبک و سنگین - 22.حادثه  - 23.مواضع
        public static string[,] mansoobat = new string[16, 24] {
            { "آتش", "سعد", "مذکر", "مشتری", "قوس", "پنجشنبه", "شرقی", "معدنی", "سفید", "سر", "دایره", "پاییز", "اف", "حال", "صفراء", "شیرین", "علماء", "باز", "جوان", "روزی", "گرو و خشک", "سبک", "امنیت", "مساجد" },
            { "باد", "نحس", "مذکر", "مریخ", "حمل", "سه‌شنبه", "غربی", "حیوانی", "سرخ", "ران و کفل", "طویل", "پاییز", "بص", "مستقبل", "بلغم", "تلخ", "قصّاب", "بسته", "جوان", "روزی", "گرم و رطوبی", "سبک", "قتال", "معابد یهود" },
            { "آتش", "سعد", "مذکر", "شمس", "اسد", "یکشنبه", "شرقی", "معدنی", "زرد", "ساق یا ران", "طویل", "تابستان", "لع", "حال", "بلغم", "شیرین", "ملوک", "باز", "پیر", "شبی", "گرم و خشک", "سبک", "جور و ظلم", "قصر" },
            { "آب", "سعد", "مونث", "قمر", "سرطان", "دوشنبه", "شمالی", "نباتی", "سفید", "ران یا کفل", "دایره", "بهار", "جق", "ماضی", "صفراء", "شور", "زهّاد", "بسته", "جوان", "شبی", "سرد و مرطوبی", "سنگین", "طغیان آب", "شاهراه" },
            { "آتش", "نحس", "مذکر", "رأس", "دلو", "سه‌شنبه", "شرقی", "معدنی", "خاکستری", "بازو", "مثلث", "زمستان", "هش", "ماضی", "صفراء بلغم", "تلخ", "وزراء", "باز", "جوان", "روزی", "گرم و خشک", "سبک", "وباء و مرض", "سنگستان" },
            { "باد", "ممتزج", "خنثی", "عطارد", "جوزاء", "چهارشنبه", "غربی", "حیوانی", "کبودی", "معده", "مجوّف", "تابستان", "وت", "ماضی", "بلغم خون", "شیرین", "اهل علم", "بسته", "پیر", "هیچکدام", "گرم و مرطوب", "سبک", "وقوع اراجیف", "مکتب و مدرسه" },
            { "آتش", "نحس", "مذکر", "ذنب", "جدی", "سه‌شنبه", "شرقی", "معدنی", "خاک", "ذکر", "طویل", "زمستان", "زث", "ماضی", "صفراؤ خون", "تند", "وزراء", "باز", "جوان", "شبی", "گرم و خشک", "سبک", "وباء و شدت", "محل فتنه" },
            { "خاک", "نحس", "مونث", "زحل", "جدی", "شنبه", "جنوبی", "کانی", "زرد", "ناف", "طویل", "زمستان", "حخ", "حال", "از خون", "ترش", "دهقانان", "بسته", "پیر", "شبی", "سرد و خشک", "سنگین", "زلزله", "کنیسه یهود" },
            { "خاک", "نحس", "مذکر", "زحل", "دلو", "شب شنبه", "جنوبی", "کانی", "سیاه", "شکم", "دایره مجوّف", "زمستان", "طز", "ماضی", "درد پهلو", "ترش تند", "دهقانان", "بسته", "پیر", "روزی", "سرد و خشک", "سنگین", "آفت و مرض", "اصطبل" },
            { "خاک", "سعد", "مونث", "شمس", "اسد", "یکشنبه", "جنوبی", "کانی", "زرد", "گردن", "مربع", "بهار", "یض", "مستقبل", "سوداء", "شیرین", "امراء و بزرگان", "بسته", "جوان", "شبی", "سرد و خشک", "سنگین", "فراوانی نعمت", "بازار" },
            { "باد", "سعد", "مذکر", "زهره", "یزان", "جمعه", "غربی", "حیوانی", "گندمی", "قلب یا سینه", "دایره", "پاییز", "مظ", "مستقبل", "صفراء سوداء", "شیرین", "مطربان", "بسته", "صبیّ", "روزی", "گرم و مرطوب", "سبک", "فسق و ظلم", "محل عیش" },
            { "آب", "سعد", "مونث", "مشتری", "حوت", "پنجشنبه", "شمالی", "نباتی", "سفید", "زانو یا قلب", "دایره", "تابستان", "لع", "مستقبل", "صفراء خون", "شیرین", "علماء و قضات", "بسته", "پیر", "روزی", "سرد و رطوبی", "سنگین", "امنیت ", "محل علماء" },
            { "آب", "نحس", "مونث", "مریخ", "عقرب", "سه‌شنبه", "شمالی", "نباتی", "کبود", "ساق", "دایره", "پاییز", "م", "حال", "بلغم", "تلخ تند", "آهنگران", "بسته", "جوان", "روزی", "سرد و رطوبی", "سنگین", "خوف و هراس", "محل خواب" },
            { "باد", "سعد", "مونث", "زهره", "ثور", "جمعه", "غربی", "حیوانی", "سفید", "فرج یا ران", "مربع", "پاییز", "ن", "مستقبل", "سوداء خون", "شیرین", "عبّاد", "بسته", "جوان", "شبی", "گرم و رطوبی", "سبک", "نعمت امن و فراوانی", "محل عیش" },
            { "آب", "سعد", "مونث", "قمر", "سرطان", "دوشنبه", "شمالی", "نباتی", "سفید مایل به سبز", "پای راست", "طویل", "تابستان", "س", "حال", "سوداء", "شور", "پیک و ایلچی", "باز", "جوان", "شبی", "سرد و رطوبی", "سنگین", "ترس", "شاهراه" },
            { "خاک", "ممتزج", "مونث", "عطارد", "سنبله", "چهارشنبه", "جنوبی", "کانی", "بنفش", "سینه یا پشت", "مجوّف", "بهار", "ع", "حال", "سوداء", "گوناگون", "منجمان", "بسته", "پیر", "هیچکدام", "سرد و خشک", "سنگین", "خونریزی", "صحراء" } };
        #endregion

        public static string[] boyuot(int[] satr)
        {
            string[] beyt = new string[16];
            for (int i = 0; i < 16; i++)
                beyt[i] = "";

            //  امهات
            for (int n = 0, m = 0; m < 16; m++)
            {
                if (satr[m] % 2 == 0)
                    beyt[n] += "|";
                else
                    beyt[n] += ".";
                if (m % 4 == 3)
                    n++;
            }

            //  بنات
            for (int n = 4, m = 0; m < 16; m++, n++)
            {
                if (n == 8)
                    n = 4;
                if (satr[m] % 2 == 0)
                    beyt[n] += "|";
                else
                    beyt[n] += ".";
            }

            //  متولدات
            beyt[8] = zarb(beyt[0], beyt[1]);
            beyt[9] = zarb(beyt[2], beyt[3]);
            beyt[10] = zarb(beyt[4], beyt[5]);
            beyt[11] = zarb(beyt[6], beyt[7]);

            //  زوائد
            beyt[12] = zarb(beyt[8], beyt[9]);
            beyt[13] = zarb(beyt[10], beyt[11]);
            beyt[14] = zarb(beyt[12], beyt[13]);
            beyt[15] = zarb(beyt[14], beyt[0]);

            return beyt;
        }

        public static string zarb(string a, string b)
        {
            string c = "";
            for (int i = 0; i < 4; i++)
            {
                if (a.Substring(i, 1) == b.Substring(i, 1))
                    c += "|";
                else
                    c += ".";
            }
            return c;
        }

        public static int[] SheklbeN(string[] shekl)
        {
            int[] n = new int[shekl.LongLength];

            for (int i = 0; i < shekl.LongLength; i++)
            {
                n[i] = 0;
                if (shekl[i] != "")
                {
                    if (shekl[i].Substring(0, 1) == ".")
                        n[i]++;
                    if (shekl[i].Substring(1, 1) == ".")
                        n[i] += 2;
                    if (shekl[i].Substring(2, 1) == ".")
                        n[i] += 4;
                    if (shekl[i].Substring(3, 1) == ".")
                        n[i] += 8;
                    if (n[i] == 0)
                        n[i] = 16;
                }
            }
            return n;
        }

        public static string[] NbeShekl(int[] n)
        {
            string[] shekl = new string[n.LongLength];
            for (int i = 0; i < shekl.LongLength; i++)
            {
                shekl[i] = "";
                if (n[i] == 16) n[i] = 0;
                if (n[i] >= 0 && n[i] < 16)
                    for (int j = 3; j >= 0; j--)
                    {
                        int k = Convert.ToInt32(Math.Pow(2, j));
                        if (n[i] >= k)
                        {
                            shekl[i] = "." + shekl[i];
                            n[i] -= k;
                        }
                        else
                            shekl[i] = "|" + shekl[i];
                    }
            }
            return shekl;
        }
    }
}
